wwkkww1983/STM32F407VET6Project/Application/I2C/i2c_cfg.c
///////////////////////////////////////////////////////////////////////////////
//////函		数：
//////功		能：
//////输入参数:
//////输出参数:
//////说		明：
//////////////////////////////////////////////////////////////////////////////
UINT8_T I2C_MHW_CheckBusy(I2C_HandlerType* I2Cx)
{
	//---保证I2C外设不在使用中
	UINT8_T _return = I2C_MHW_PollMode_WaitFlag(I2Cx, LL_I2C_IsActiveFlag_BUSY, RESET);
	//---检查到忙标识
	//if(LL_I2C_IsActiveFlag_BUSY(I2Cx->msgI2Cx)!=0)
	if(_return!=OK_0)
	{
		_return=ERROR_1;
		UINT8_T i=0;
		//---GPIO的结构体
		LL_GPIO_InitTypeDef GPIO_InitStruct = { 0 };
		//---GPIO的初始化
		GPIO_InitStruct.Pin = I2Cx->msgSCL.msgBit;																		//---对应的GPIO的引脚
		GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;																		//---配置状态为输出模式
		GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;																//---GPIO的速度---低速设备
		GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_OPENDRAIN;															//---输出模式---开漏输出
		GPIO_InitStruct.Pull = LL_GPIO_PULL_UP;																			//---上拉
	#ifndef USE_MCU_STM32F1
		GPIO_InitStruct.Alternate = LL_GPIO_AF_0;																		//---端口复用模式
	#endif
		//---SCL的初始化
		LL_GPIO_Init(I2Cx->msgSCL.msgPort, &GPIO_InitStruct);
		//---SCL发送9个脉冲，用于释放总线
		for(i=0;i<10;i++)
		{
			GPIO_OUT_1(I2Cx->msgSCL.msgPort, I2Cx->msgSCL.msgBit);
			I2Cx->msgDelayus(50);
			GPIO_OUT_0(I2Cx->msgSCL.msgPort, I2Cx->msgSCL.msgBit);
			I2Cx->msgDelayus(50);
		}
		//---I2C端口的复用模式
		GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;																	//---配置状态为输出模式
	#ifndef USE_MCU_STM32F1
		GPIO_InitStruct.Alternate = I2Cx->msgGPIOAlternate;																//---端口复用模式
	#endif
		//---SCL的初始化
		LL_GPIO_Init(I2Cx->msgSCL.msgPort, &GPIO_InitStruct);
		GPIO_OUT_1(I2Cx->msgSCL.msgPort, I2Cx->msgSCL.msgBit);
	#ifdef  USE_RESET_I2C
		//---复位I2C
		LL_I2C_EnableReset(I2Cx->msgI2Cx);
		//---清除复位
		LL_I2C_DisableReset(I2Cx->msgI2Cx);
		I2Cx->msgI2Cx->CR1	=I2Cx->msgI2CxReg.CR1	;
		I2Cx->msgI2Cx->CR2  =I2Cx->msgI2CxReg.CR2	;
		I2Cx->msgI2Cx->OAR1	=I2Cx->msgI2CxReg.OAR1	;
		I2Cx->msgI2Cx->OAR2	=I2Cx->msgI2CxReg.OAR2	;
		I2Cx->msgI2Cx->CCR	=I2Cx->msgI2CxReg.CCR	;
		I2Cx->msgI2Cx->TRISE=I2Cx->msgI2CxReg.TRISE	;
	#endif
	}
	return _return;
}


///////////////////////////////////////////////////////////////////////////////
//////函		数：
//////功		能：发送数据
//////输入参数:
//////输出参数:
//////说		明：最后一次发送数据使用isBTF为1，用使用BTF标志位，用于验证数据传输完成
//////////////////////////////////////////////////////////////////////////////
UINT8_T I2C_MHW_PollMode_SendByte(I2C_HandlerType* I2Cx, UINT8_T val,UINT8_T isBTF)
{
	//---地址位已经置位,通常TXE也会完成,为了谨慎,再查一下
	UINT8_T _return= I2C_MHW_PollMode_WaitFlag(I2Cx, LL_I2C_IsActiveFlag_TXE, SET);
	//---校验地址置位
	if (_return==OK_0)
	{
		//---发送数据
		LL_I2C_TransmitData8(I2Cx->msgI2Cx, val);
		//---校验发送寄存器空
		_return = I2C_MHW_PollMode_WaitFlag(I2Cx, LL_I2C_IsActiveFlag_TXE, SET);
		//---校验数据传输完成
		if ((_return==OK_0)&&(isBTF!=0))
		{
			_return = I2C_MHW_PollMode_WaitFlag(I2Cx, LL_I2C_IsActiveFlag_BTF, SET);
		}
	}	
	return _return;
}

///////////////////////////////////////////////////////////////////////////////
//////函		数：
//////功		能：读取数据
//////输入参数:
//////输出参数:
//////说		明：
//////////////////////////////////////////////////////////////////////////////
UINT8_T I2C_MHW_PollMode_ReadByte(I2C_HandlerType* I2Cx)
{
	//---校验接收寄存器不为空
	UINT8_T _return= I2C_MHW_PollMode_WaitFlag(I2Cx, LL_I2C_IsActiveFlag_RXNE, SET);
	//---校验读取
	if (_return==OK_0)
	{
		//---数据已读取
		_return= LL_I2C_ReceiveData8(I2Cx->msgI2Cx);
	}
	return _return;
}
//////////////////////////////////////////////////////////////////////////////
//<<<===硬件I2C主机---结束

///////////////////////////////////////////////////////////////////////////////
//////函		数：
//////功		能：
//////输入参数:
//////输出参数:
//////说		明：
//////////////////////////////////////////////////////////////////////////////
UINT8_T I2C_Master_DeInit(I2C_HandlerType* I2Cx)
{
	//---注销I2C设备
	return ((I2Cx->msgHwMode != 0) ? (I2C_MHW_DeInit(I2Cx)) : (I2C_MSW_DeInit(I2Cx)));
}